In [1]:
import pandas as pd

In [2]:
import pandas as pd
dict1 = {'Name': ['Priyang', 'Aadhya', 'Krisha', 'Vedant', 'Parshv', 'Mittal', 'Archana'],
                 'Marks': [98, 89, 99, 87, 90, 83, 99],
                  'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female']}

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. Display Top3 Rows of the Datasets

In [4]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2. Check Last 3 Rows of the Datasets

In [5]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

 # Find Shape of our Dataset(Number of Rows & Number of Columns)

In [6]:
print("Number of Rows", df1.shape[0])
print("Number of Columns", df1.shape[1])

Number of Rows 7
Number of Columns 3

# 4. Get Information About Our Dataset Like Total Number of Rows, Total Number of Columns, DataTypes of Each Column And Memory Requirements.

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# 5. Check Null Values in the Datasets.

In [11]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# 6. Get Overall Statistics of the Datasets.

In [13]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 7. Find Unique Values From the Gender Column

In [16]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 8. Find the Number of Unique Values from the Gender Columns.

In [17]:
df1['Gender'].nunique()

2

# 9. Display Count of Unique Values in Gender Columns.

In [18]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# 10. Find Total Number of Students Having Marks Between 90 To 100 (inclusive) Using Between Method.

In [23]:
len(df1[(df1['Marks'] >= 90) & (df1['Marks'] <=100)])

4

In [28]:
sum(df1['Marks'].between(90, 100))

4

# 11. Find Average Marks.

In [29]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [32]:
df1['Marks'].mean()

92.14285714285714

In [33]:
df1['Marks'].sum()

645

In [34]:
df1['Marks'].min()

83

In [35]:
df1['Marks'].max()

99

# 2. Apply Method

In [51]:
def marks(x):
    return x // 2

In [52]:
df1['Half_Marks'] = df1['Marks'].apply(marks)

In [53]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [54]:
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [55]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# 13. Map Function

In [58]:
df1['Male_Female'] = df1['Gender'].map({'Male': 1, 'Female': 0})

In [59]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

# 14. Drop the Columns

In [60]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [63]:
df1.drop('Male_Female', axis=1)

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [64]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [65]:
df1.drop('Half_Marks', axis=1)

      Name  Marks  Gender  Male_Female
0  Priyang     98    Male            1
1   Aadhya     89  Female            0
2   Krisha     99  Female            0
3   Vedant     87    Male            1
4   Parshv     90    Male            1
5   Mittal     83  Female            0
6  Archana     99  Female            0

In [67]:
df1.drop(['Half_Marks', 'Male_Female'], axis=1, inplace=True)

In [68]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 15. Print Name of the Columns

In [69]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [70]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# 16. Sort The Dataframe As per the Marks Column

In [79]:
df1.sort_values(['Marks','Gender'], ascending=[False, True])

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

# 17. Display the Name & Marks of the Female Students

In [80]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [84]:
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [87]:
df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99